{"word2idx": {"<pad>": 0, "<start>": 1, "<end>": 2, "<unk>": 3, "city": 4, "mountain": 5, "sky": 6, "sun": 7, "tree": 8, "lake": 9, "sea": 10, "beach": 11, "clouds": 12, "boats": 13, "people": 14, "branch": 15, "leaf": 16, "water": 17, "grass": 18, "palm": 19, "horizon": 20, "hills": 21, "waves": 22, "birds": 23, "land": 24, "bridge": 25, "ships": 26, "buildings": 27, "fence": 28, "island": 29, "peaks": 30, "jet": 31, "plane": 32, "runway": 33, "basket": 34, "flight": 35, "flag": 36, "f-16": 37, "tails": 38, "smoke": 39, "formation": 40, "prop": 41, "fan": 42, "reefs": 43, "anemone": 44, "ocean": 45, "close-up": 46, "coral": 47, "plants": 48, "rocks": 49, "fish": 50, "lion": 51, "wall": 52, "cave": 53, "crab": 54, "sand": 55, "flowers": 56, "tulip": 57, "petals": 58, "orchid": 59, "stems": 60, "field": 61, "farms": 62, "bush": 63, "vines": 64, "shrubs": 65, "bear": 66, "blooms": 67, "cactus": 68, "needles": 69, "house": 70, "garden": 71, "glass": 72, "arch": 73, "tower": 74, "cow": 75, "town": 76, "street": 77, "shore": 78, "dock": 79, "horses": 80, "post": 81, "sidewalk": 82, "stone": 83, "door": 84, "store": 85, "castle": 86, "road": 87, "shops": 88, "window": 89, "hut": 90, "barn": 91, "church": 92, "gate": 93, "relief": 94, "roofs": 95, "monks": 96, "monastery": 97, "buddhist": 98, "buddha": 99, "palace": 100, "man": 101, "ceremony": 102, "dance": 103, "snow": 104, "temple": 105, "pillar": 106, "horns": 107, "entrance": 108, "wood": 109, "sculpture": 110, "woman": 111, "courtyard": 112, "cars": 113, "tracks": 114, "formula": 115, "turn": 116, "prototype": 117, "statue": 118, "reflection": 119, "art": 120, "cathedral": 121, "park": 122, "sunset": 123, "village": 124, "railroad": 125, "sunrise": 126, "head": 127, "ruins": 128, "pyramid": 129, "column": 130, "stairs": 131, "face": 132, "plaza": 133, "ground": 134, "bulls": 135, "elk": 136, "herd": 137, "forest": 138, "deer": 139, "baby": 140, "fox": 141, "moose": 142, "calf": 143, "desert": 144, "reptile": 145, "snake": 146, "goat": 147, "antelope": 148, "cubs": 149, "coyote": 150, "log": 151, "lizard": 152, "grizzly": 153, "porcupine": 154, "squirrel": 155, "trunk": 156, "den": 157, "shadows": 158, "kit": 159, "lynx": 160, "cat": 161, "cougar": 162, "oahu": 163, "market": 164, "pool": 165, "coast": 166, "kauai": 167, "canyon": 168, "hotel": 169, "museum": 170, "maui": 171, "train": 172, "hawaii": 173, "monument": 174, "fruit": 175, "polar": 176, "tundra": 177, "ice": 178, "black": 179, "river": 180, "meadow": 181, "hillside": 182, "display": 183, "vegetation": 184, "path": 185, "dress": 186, "vineyard": 187, "balcony": 188, "architecture": 189, "food": 190, "fountain": 191, "cottage": 192, "sign": 193, "pots": 194, "doorway": 195, "night": 196, "light": 197, "terrace": 198, "valley": 199, "albatross": 200, "booby": 201, "nest": 202, "iguana": 203, "marine": 204, "white-tailed": 205, "skyline": 206, "slope": 207, "mule": 208, "antlers": 209, "caribou": 210, "tiger": 211, "bengal": 212, "arctic": 213, "mare": 214, "foals": 215, "harbor": 216, "windmills": 217, "restaurant": 218, "clothes": 219, "tables": 220, "nets": 221, "crafts": 222, "costume": 223, "sheep": 224, "festival": 225, "decoration": 226, "detail": 227, "sails": 228, "hats": 229, "landscape": 230, "giraffe": 231, "zebra": 232, "tusks": 233, "elephant": 234, "lawn": 235, "canal": 236, "mist": 237, "dunes": 238, "lighthouse": 239, "interior": 240, "vendor": 241, "silhouette": 242, "athlete": 243, "swimmers": 244, "butterfly": 245, "mosque": 246, "sphinx": 247, "truck": 248, "fly": 249, "frost": 250, "frozen": 251, "crystals": 252, "rodent": 253, "whales": 254, "marsh": 255, "locomotive": 256, "vehicle": 257, "girl": 258, "indian": 259, "african": 260, "outside": 261, "cafe": 262, "scotland": 263}, "idx2word": {"0": "<pad>", "1": "<start>", "2": "<end>", "3": "<unk>", "4": "city", "5": "mountain", "6": "sky", "7": "sun", "8": "tree", "9": "lake", "10": "sea", "11": "beach", "12": "clouds", "13": "boats", "14": "people", "15": "branch", "16": "leaf", "17": "water", "18": "grass", "19": "palm", "20": "horizon", "21": "hills", "22": "waves", "23": "birds", "24": "land", "25": "bridge", "26": "ships", "27": "buildings", "28": "fence", "29": "island", "30": "peaks", "31": "jet", "32": "plane", "33": "runway", "34": "basket", "35": "flight", "36": "flag", "37": "f-16", "38": "tails", "39": "smoke", "40": "formation", "41": "prop", "42": "fan", "43": "reefs", "44": "anemone", "45": "ocean", "46": "close-up", "47": "coral", "48": "plants", "49": "rocks", "50": "fish", "51": "lion", "52": "wall", "53": "cave", "54": "crab", "55": "sand", "56": "flowers", "57": "tulip", "58": "petals", "59": "orchid", "60": "stems", "61": "field", "62": "farms", "63": "bush", "64": "vines", "65": "shrubs", "66": "bear", "67": "blooms", "68": "cactus", "69": "needles", "70": "house", "71": "garden", "72": "glass", "73": "arch", "74": "tower", "75": "cow", "76": "town", "77": "street", "78": "shore", "79": "dock", "80": "horses", "81": "post", "82": "sidewalk", "83": "stone", "84": "door", "85": "store", "86": "castle", "87": "road", "88": "shops", "89": "window", "90": "hut", "91": "barn", "92": "church", "93": "gate", "94": "relief", "95": "roofs", "96": "monks", "97": "monastery", "98": "buddhist", "99": "buddha", "100": "palace", "101": "man", "102": "ceremony", "103": "dance", "104": "snow", "105": "temple", "106": "pillar", "107": "horns", "108": "entrance", "109": "wood", "110": "sculpture", "111": "woman", "112": "courtyard", "113": "cars", "114": "tracks", "115": "formula", "116": "turn", "117": "prototype", "118": "statue", "119": "reflection", "120": "art", "121": "cathedral", "122": "park", "123": "sunset", "124": "village", "125": "railroad", "126": "sunrise", "127": "head", "128": "ruins", "129": "pyramid", "130": "column", "131": "stairs", "132": "face", "133": "plaza", "134": "ground", "135": "bulls", "136": "elk", "137": "herd", "138": "forest", "139": "deer", "140": "baby", "141": "fox", "142": "moose", "143": "calf", "144": "desert", "145": "reptile", "146": "snake", "147": "goat", "148": "antelope", "149": "cubs", "150": "coyote", "151": "log", "152": "lizard", "153": "grizzly", "154": "porcupine", "155": "squirrel", "156": "trunk", "157": "den", "158": "shadows", "159": "kit", "160": "lynx", "161": "cat", "162": "cougar", "163": "oahu", "164": "market", "165": "pool", "166": "coast", "167": "kauai", "168": "canyon", "169": "hotel", "170": "museum", "171": "maui", "172": "train", "173": "hawaii", "174": "monument", "175": "fruit", "176": "polar", "177": "tundra", "178": "ice", "179": "black", "180": "river", "181": "meadow", "182": "hillside", "183": "display", "184": "vegetation", "185": "path", "186": "dress", "187": "vineyard", "188": "balcony", "189": "architecture", "190": "food", "191": "fountain", "192": "cottage", "193": "sign", "194": "pots", "195": "doorway", "196": "night", "197": "light", "198": "terrace", "199": "valley", "200": "albatross", "201": "booby", "202": "nest", "203": "iguana", "204": "marine", "205": "white-tailed", "206": "skyline", "207": "slope", "208": "mule", "209": "antlers", "210": "caribou", "211": "tiger", "212": "bengal", "213": "arctic", "214": "mare", "215": "foals", "216": "harbor", "217": "windmills", "218": "restaurant", "219": "clothes", "220": "tables", "221": "nets", "222": "crafts", "223": "costume", "224": "sheep", "225": "festival", "226": "decoration", "227": "detail", "228": "sails", "229": "hats", "230": "landscape", "231": "giraffe", "232": "zebra", "233": "tusks", "234": "elephant", "235": "lawn", "236": "canal", "237": "mist", "238": "dunes", "239": "lighthouse", "240": "interior", "241": "vendor", "242": "silhouette", "243": "athlete", "244": "swimmers", "245": "butterfly", "246": "mosque", "247": "sphinx", "248": "truck", "249": "fly", "250": "frost", "251": "frozen", "252": "crystals", "253": "rodent", "254": "whales", "255": "marsh", "256": "locomotive", "257": "vehicle", "258": "girl", "259": "indian", "260": "african", "261": "outside", "262": "cafe", "263": "scotland"}, "idx": 264}